/*************************************************************************
* > File Name: test_lseek.c
* > Author   : rack
* > Function : 测试标准输入能否设置偏移量
* > Type     :
* > Github   : https://github.com/rack-leen
* > Date     : 2018年06月01日 星期五 21时38分25秒
**************************************************************************/

/*************************************************************************
* > 头文件
**************************************************************************/
#include "apue.h"

int main(void)
{/* 从标准输入输入文件，将该文件的偏移量设置为当前值加offset;文件偏移量应该是一个非负数 */
    if(lseek(STDIN_FILENO , 0 , SEEK_CUR) == -1) /* 如果文件偏移量返回为-1表示返回为负数 */
    {
        printf("cannot seek\n");
    }
    else
    {
        printf("seek OK\n");
    }

    exit(0);
}

